---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyManufacturer
source: html/ef04dca2-7b5a-8779-ca73-b7a699de0a22.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyManufacturer Property

"Assembly: Manufacturer"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetAssemblyManufacturer { get; }
```